# Ex 4.2: Part 2 (Outside Class)

## 1. Get Data

In [1]:
import pandas as pd 
import plotly.express as px

In [2]:
tables = pd.read_html('https://www.imdb.com/chart/toptv/?ref_=nv_tvv_250/')

tables

[     Unnamed: 0                              Rank & Title  IMDb Rating  \
 0           NaN               1.  Planet Earth II  (2016)          9.4
 1           NaN                  2.  Breaking Bad  (2008)          9.4
 2           NaN                  3.  Planet Earth  (2006)          9.4
 3           NaN              4.  Band of Brothers  (2001)          9.4
 4           NaN                     5.  Chernobyl  (2019)          9.3
 ..          ...                                       ...          ...
 245         NaN  246.  Garth Marenghi's Darkplace  (2004)          8.4
 246         NaN                247.  The Punisher  (2017)          8.4
 247         NaN                 248.  Foyle's War  (2002)          8.4
 248         NaN            249.  Mare of Easttown  (2021)          8.4
 249         NaN                 250.  Kardes Payi  (2014)          8.4

                             Your Rating  Unnamed: 4
 0    12345678910 NOT YET RELEASED  Seen         NaN
 1    12345678910 NOT YET RELEASED  Seen         NaN
 2    12345678910 NOT YET RELEASED  Seen         NaN
 3    12345678910 NOT YET RELEASED  Seen         NaN
 4    12345678910 NOT YET RELEASED  Seen         NaN
 ..                                  ...         ...
 245  12345678910 NOT YET RELEASED  Seen         NaN
 246  12345678910 NOT YET RELEASED  Seen         NaN
 247  12345678910 NOT YET RELEASED  Seen         NaN
 248  12345678910 NOT YET RELEASED  Seen         NaN
 249  12345678910 NOT YET RELEASED  Seen         NaN

 [250 rows x 5 columns]]

In [3]:
type(tables)

list

In [4]:
print("Number of Tables of Data in tables List:  ", len(tables))

Number of Tables of Data in tables List:   1

In [5]:
tables[0]
#tables[1]
#tables[2]

,Unnamed: 0,Rank & Title,IMDb Rating,Your Rating,Unnamed: 4
0,NaN,1. Planet Earth II (2016),9.4,12345678910 NOT YET RELEASED Seen,NaN
1,NaN,2. Breaking Bad (2008),9.4,12345678910 NOT YET RELEASED Seen,NaN
2,NaN,3. Planet Earth (2006),9.4,12345678910 NOT YET RELEASED Seen,NaN
3,NaN,4. Band of Brothers (2001),9.4,12345678910 NOT YET RELEASED Seen,NaN
4,NaN,5. Chernobyl (2019),9.3,12345678910 NOT YET RELEASED Seen,NaN
...,...,...,...,...,...
245,NaN,246. Garth Marenghi's Darkplace (2004),8.4,12345678910 NOT YET RELEASED Seen,NaN
246,NaN,247. The Punisher (2017),8.4,12345678910 NOT YET RELEASED Seen,NaN
247,NaN,248. Foyle's War (2002),8.4,12345678910 NOT YET RELEASED Seen,NaN
248,NaN,249. Mare of Easttown (2021),8.4,12345678910 NOT YET RELEASED Seen,NaN
249,NaN,250. Kardes Payi (2014),8.4,12345678910 NOT YET RELEASED Seen,NaN

In [6]:
df = pd.DataFrame(tables[0])  

print("Ex 4.2 Part 2")
print(df.shape)
df.head()

Ex 4.2 Part 2
(250, 5)

,Unnamed: 0,Rank & Title,IMDb Rating,Your Rating,Unnamed: 4
0,NaN,1. Planet Earth II (2016),9.4,12345678910 NOT YET RELEASED Seen,NaN
1,NaN,2. Breaking Bad (2008),9.4,12345678910 NOT YET RELEASED Seen,NaN
2,NaN,3. Planet Earth (2006),9.4,12345678910 NOT YET RELEASED Seen,NaN
3,NaN,4. Band of Brothers (2001),9.4,12345678910 NOT YET RELEASED Seen,NaN
4,NaN,5. Chernobyl (2019),9.3,12345678910 NOT YET RELEASED Seen,NaN

In [7]:
df.dtypes

Unnamed: 0      float64
Rank & Title     object
IMDb Rating     float64
Your Rating      object
Unnamed: 4      float64
dtype: object

## 2. Drop columns not used

In [8]:
df.columns

Index(['Unnamed: 0', 'Rank & Title', 'IMDb Rating', 'Your Rating',
       'Unnamed: 4'],
      dtype='object')

In [9]:
df.drop(["Unnamed: 0", "Unnamed: 4", "Your Rating"], axis='columns', inplace=True)
df.head()

                   Rank & Title  IMDb Rating
0   1.  Planet Earth II  (2016)          9.4
1      2.  Breaking Bad  (2008)          9.4
2      3.  Planet Earth  (2006)          9.4
3  4.  Band of Brothers  (2001)          9.4
4         5.  Chernobyl  (2019)          9.3

## 3. Split Column

In [10]:
df.columns

Index(['Rank & Title', 'IMDb Rating'], dtype='object')

In [11]:
two_new_cols = ['Rank', 'ReDo']

df[two_new_cols] = df['Rank & Title'].str.split('.',1, expand=True)

print(df.shape)
df.head()

(250, 4)

                   Rank & Title  IMDb Rating Rank                        ReDo
0   1.  Planet Earth II  (2016)          9.4    1     Planet Earth II  (2016)
1      2.  Breaking Bad  (2008)          9.4    2        Breaking Bad  (2008)
2      3.  Planet Earth  (2006)          9.4    3        Planet Earth  (2006)
3  4.  Band of Brothers  (2001)          9.4    4    Band of Brothers  (2001)
4         5.  Chernobyl  (2019)          9.3    5           Chernobyl  (2019)

In [12]:
df.drop("Rank & Title", axis='columns', inplace=True)
df.head()

   IMDb Rating Rank                        ReDo
0          9.4    1     Planet Earth II  (2016)
1          9.4    2        Breaking Bad  (2008)
2          9.4    3        Planet Earth  (2006)
3          9.4    4    Band of Brothers  (2001)
4          9.3    5           Chernobyl  (2019)

In [13]:
two_new_cols = ['TV Show', 'Year_ReDo']

df[two_new_cols] = df['ReDo'].str.split('(',1, expand=True)

print(df.shape)
df.head()

(250, 5)

,IMDb Rating,Rank,ReDo,TV Show,Year_ReDo
0,9.4,1,Planet Earth II (2016),Planet Earth II,2016)
1,9.4,2,Breaking Bad (2008),Breaking Bad,2008)
2,9.4,3,Planet Earth (2006),Planet Earth,2006)
3,9.4,4,Band of Brothers (2001),Band of Brothers,2001)
4,9.3,5,Chernobyl (2019),Chernobyl,2019)

In [14]:
df.drop("ReDo", axis='columns', inplace=True)
df.head()

   IMDb Rating Rank               TV Show Year_ReDo
0          9.4    1     Planet Earth II       2016)
1          9.4    2        Breaking Bad       2008)
2          9.4    3        Planet Earth       2006)
3          9.4    4    Band of Brothers       2001)
4          9.3    5           Chernobyl       2019)

## 4. Rename columns

In [15]:
df.columns

Index(['IMDb Rating', 'Rank', 'TV Show', 'Year_ReDo'], dtype='object')

In [16]:
cols_to_rename = {
                   'IMDb Rating':'IMDB Score'
                 }
df.rename(columns = cols_to_rename, inplace=True)
df.head()

   IMDB Score Rank               TV Show Year_ReDo
0         9.4    1     Planet Earth II       2016)
1         9.4    2        Breaking Bad       2008)
2         9.4    3        Planet Earth       2006)
3         9.4    4    Band of Brothers       2001)
4         9.3    5           Chernobyl       2019)

## 5. Changing data types

In [17]:
df.dtypes

IMDB Score    float64
Rank           object
TV Show        object
Year_ReDo      object
dtype: object

In [18]:
two_new_cols = ['Year', 'Delete']

df[two_new_cols] = df['Year_ReDo'].str.split(')',1, expand=True)

print(df.shape)
df.head()

(250, 6)

   IMDB Score Rank               TV Show Year_ReDo  Year Delete
0         9.4    1     Planet Earth II       2016)  2016
1         9.4    2        Breaking Bad       2008)  2008
2         9.4    3        Planet Earth       2006)  2006
3         9.4    4    Band of Brothers       2001)  2001
4         9.3    5           Chernobyl       2019)  2019

In [19]:
df.drop(["Year_ReDo", "Delete"], axis='columns', inplace=True)
df.head()

   IMDB Score Rank               TV Show  Year
0         9.4    1     Planet Earth II    2016
1         9.4    2        Breaking Bad    2008
2         9.4    3        Planet Earth    2006
3         9.4    4    Band of Brothers    2001
4         9.3    5           Chernobyl    2019

In [20]:
df['Rank'] = df['Rank'].astype(int)
df['Year'] = df['Year'].astype(int)

In [21]:
df.dtypes

IMDB Score    float64
Rank            int32
TV Show        object
Year            int32
dtype: object

In [22]:
df.head()

   IMDB Score  Rank               TV Show  Year
0         9.4     1     Planet Earth II    2016
1         9.4     2        Breaking Bad    2008
2         9.4     3        Planet Earth    2006
3         9.4     4    Band of Brothers    2001
4         9.3     5           Chernobyl    2019

## 6. Keeping and Reordering Columns

In [23]:
df.columns

Index(['IMDB Score', 'Rank', 'TV Show', 'Year'], dtype='object')

In [26]:
cols_to_keep = ['TV Show', 'Rank', 'IMDB Score', 'Year']
df = df[cols_to_keep]

print("Part 2", df.shape)
df.head(10)

Part 2 (250, 4)

                           TV Show  Rank  IMDB Score  Year
0                Planet Earth II       1         9.4  2016
1                   Breaking Bad       2         9.4  2008
2                   Planet Earth       3         9.4  2006
3               Band of Brothers       4         9.4  2001
4                      Chernobyl       5         9.3  2019
5                       The Wire       6         9.3  2002
6                 Blue Planet II       7         9.2  2017
7     Avatar: The Last Airbender       8         9.2  2005
8    Cosmos: A Spacetime Odyssey       9         9.2  2014
9                   The Sopranos      10         9.2  1999

In [25]:
df.dtypes

TV Show        object
Rank            int32
IMDB Score    float64
Year            int32
dtype: object